[
  {
    "author": "Chinua Achebe",
    "country": "Nigeria",
    "imageLink": "images/things-fall-apart.jpg",
    "language": "English",
    "link": "https://en.wikipedia.org/wiki/Things_Fall_Apart\n",
    "pages": 209,
    "title": "Things Fall Apart",
    "year": 1958,
    "shortD": "Its story chronicles pre-colonial life in the south-eastern part of Nigeria and the arrival of the Europeans during the late nineteenth century",
    "longD":"The novel's protagonist Okonkwo is famous in the villages of Umuofia for being a wrestling champion, defeating a wrestler nicknamed Amalinze The Cat (because he never lands on his back). Okonkwo is strong, hard-working, and strives to show no weakness. He wants to dispel his father Unoka's tainted legacy of unpaid debts, a neglected wife and children, and cowardice at the sight of blood. Okonkwo works to build his wealth entirely on his own, as Unoka died a shameful death and left many unpaid debts. He is also obsessed with his masculinity, and any slight compromise on this is swiftly destroyed. As a result, he often beats his wives and children, and is unkind to his neighbours. However, his drive to escape the legacy of his father leads him to be wealthy, courageous, and powerful among the people of his village. He is a leader of his village, and he has attained a position in his society for which he has striven all his life. Okonkwo is selected by the elders to be the guardian of Ikemefuna, a boy taken by the clan as a peace settlement between Umuofia and another clan after Ikemefuna's father killed an Umuofian woman. The boy lives with Okonkwo's family and Okonkwo grows fond of him, although Okonkwo doesn't show his fondness so as to not appear weak. The boy looks up to Okonkwo and considers him a second father. The Oracle of Umuofia eventually pronounces that the boy must be killed. Ezeudu, the oldest man in the village, warns Okonkwo that he should have nothing to do with the murder because it would be like killing his own child – but to avoid seeming weak and feminine to the other men of the village, Okonkwo disregards the warning from the old man, striking the killing blow himself even as Ikemefuna begs his father for protection. For many days after killing Ikemefuna, Okonkwo feels guilty and saddened. Shortly after Ikemefuna's death, things begin to go wrong for Okonkwo. His sickly daughter Ezinma falls unexpectedly ill and it is feared she may die; during a gun salute at Ezeudu's funeral, Okonkwo's gun accidentally explodes and kills Ezeudu's son. He and his family are sent into exile for seven years to appease the gods he has offended. While Okonkwo is away in Mbanta, he learns that white men are living in Umuofia with the intent of introducing their religion, Christianity. As the number of converts increases, the foothold of the white people grows and a new government is introduced.[2] The village is forced to respond with either appeasement or resistance to the imposition of the white people's nascent society. Returning from exile, Okonkwo finds his village changed by the presence of the white men. After a convert commits a heinous act by unmasking an elder as he embodies an ancestral spirit of the clan, the village retaliates by destroying a local Christian church. In response, the District Commissioner representing the British government takes Okonkwo and several other native leaders prisoner pending payment of a fine of two hundred cowries. Despite the District Commissioner's instructions to treat the leaders of Umuofia with respect, the native 'court messengers' humiliate them, doing things such as shaving their heads and whipping them. As a result, the people of Umuofia finally gather for what could be a great uprising. Okonkwo, a warrior by nature and adamant about following Umuofian custom and tradition, despises any form of cowardice and advocates war against the white men. When messengers of the white government try to stop the meeting, Okonkwo beheads one of them. Because the crowd allows the other messengers to escape, and does not fight alongside Okonkwo, he realizes with despair that the people of Umuofia are not going to fight to protect themselves – his society's response to such a conflict, which for so long had been predictable and dictated by tradition, is changing. When the local leader of the white government, the District Commissioner, comes to Okonkwo's house to take him to court, he finds that Okonkwo has hanged himself to avoid being tried in a colonial court. Among his own people, Okonkwo's actions have tarnished his reputation and status, as it is strictly against the teachings of the Igbo to commit suicide.[3] The District Commissioner reflects that the story of Okonkwo will make for a good page in his book, or perhaps a reasonable paragraph."
  },
  {
    "author": "Hans Christian Andersen",
    "country": "Denmark",
    "imageLink": "images/fairy-tales.jpg",
    "language": "Danish",
    "link": "https://en.wikipedia.org/wiki/Fairy_Tales_Told_for_Children._First_Collection.\n",
    "pages": 784,
    "title": "Fairy tales",
    "year": 1836,
    "shortD": "Its a collection of nine fairy tales by Hans Christian Andersen. The tales were published in a series of three installments by C. A. Reitzel in Copenhagen, Denmark between May 1835 and April 1837, and represent Andersen's first venture into the fairy tale genre",
    "longD":"The first installment of sixty-one unbound pages was published 8 May 1835 and contained \"The Tinderbox\", \"Little Claus and Big Claus\", \"The Princess and the Pea\" and \"Little Ida's Flowers\". The first three tales were based on folktales Andersen had heard in his childhood while the last tale was completely Andersen's invention and created for Ida Thiele, the daughter of Andersen's early benefactor, the folklorist Just Matthias Thiele. Reitzel paid Andersen thirty rixdollars for the manuscript, and the booklet was priced at twenty-four shillings.The second booklet was published on 16 December 1835 and contained \"Thumbelina\", \"The Naughty Boy\" and \"The Traveling Companion\". \"Thumbelina\" was completely Andersen's invention though inspired by \"Tom Thumb\" and other stories of miniature people. \"The Naughty Boy\" was based on a poem by Anacreon about Cupid, and \"The Traveling Companion\" was a ghost story with which Andersen had experimented in 1830. The third booklet contained \"The Little Mermaid\" and \"The Emperor's New Clothes\", and was published 7 April 1837. \"The Little Mermaid\" was completely Andersen's creation though influenced by De la Motte Fouqué's \"Undine\" (1811) and lore about mermaids. The tale established his international reputation. The only other tale in the third booklet was \"The Emperor's New Clothes\", which was based on a medieval Spanish story with Arab and Jewish sources. On the eve of the third installment's publication, Andersen changed the end of his tale (the Emperor simply walks in procession) to its now familiar finale of a child calling out, \"The Emperor is not wearing any clothes!\" Danish reviews for the first two booklets appeared in 1836 and were not enthusiastic. Critics disliked the chatty, informal style and an immorality that flew in the face of their expectations that children's literature was meant to educate rather than amuse. The critics discouraged Andersen from pursuing the genre. Andersen believed he was working against the critics' preconceived notions about fairy tales, and temporarily returned to novel-writing. The critical reaction was so severe, he waited a full year before publishing the third installment. The nine tales of the three booklets were collected together and published in one volume and sold at seventy-two shillings. A title page, a table of contents, and a preface by Andersen were published in the volume."
  },
  {
    "author": "Dante Alighieri",
    "country": "Italy",
    "imageLink": "images/the-divine-comedy.jpg",
    "language": "Italian",
    "link": "https://en.wikipedia.org/wiki/Divine_Comedy\n",
    "pages": 928,
    "title": "The Divine Comedy",
    "year": 1315,
    "shortD": "Its a long Italian narrative poem by Dante Alighieri, begun c. 1308 and completed in 1320, a year before his death in 1321. It is widely considered to be the pre-eminent work in Italian literature and one of the greatest works of world literature",
    "longD": "The Divine Comedy is composed of 14,233 lines that are divided into three cantiche (singular cantica) – Inferno (Hell), Purgatorio (Purgatory), and Paradiso (Paradise) – each consisting of 33 cantos (Italian plural canti). An initial canto, serving as an introduction to the poem and generally considered to be part of the first cantica, brings the total number of cantos to 100. It is generally accepted, however, that the first two cantos serve as a unitary prologue to the entire epic, and that the opening two cantos of each cantica serve as prologues to each of the three cantiche. The number three is prominent in the work (alluding to the Trinity), represented in part by the number of cantiche and their lengths. Additionally, the verse scheme used, terza rima, is hendecasyllabic (lines of eleven syllables), with the lines composing tercets according to the rhyme scheme aba, bcb, cdc, ded, .... Written in the first person, the poem tells of Dante's journey through the three realms of the dead, lasting from the night before Good Friday to the Wednesday after Easter in the spring of 1300. The Roman poet Virgil guides him through Hell and Purgatory; Beatrice, Dante's ideal woman, guides him through Heaven. Beatrice was a Florentine woman he had met in childhood and admired from afar in the mode of the then-fashionable courtly love tradition, which is highlighted in Dante's earlier work La Vita Nuova. The structure of the three realms follows a common numerical pattern of 9 plus 1, for a total of 10: 9 circles of the Inferno, followed by Lucifer contained at its bottom; 9 rings of Mount Purgatory, followed by the Garden of Eden crowning its summit; and the 9 celestial bodies of Paradiso, followed by the Empyrean containing the very essence of God. Within each group of 9, 7 elements correspond to a specific moral scheme, subdivided into three subcategories, while 2 others of greater particularity are added to total nine. For example, the seven deadly sins of the Catholic Church that are cleansed in Purgatory are joined by special realms for the late repentant and the excommunicated by the church. The core seven sins within Purgatory correspond to a moral scheme of love perverted, subdivided into three groups corresponding to excessive love (Lust, Gluttony, Greed), deficient love (Sloth), and malicious love (Wrath, Envy, Pride). In central Italy's political struggle between Guelphs and Ghibellines, Dante was part of the Guelphs, who in general favored the Papacy over the Holy Roman Emperor. Florence's Guelphs split into factions around 1300 – the White Guelphs and the Black Guelphs. Dante was among the White Guelphs who were exiled in 1302 by the Lord-Mayor Cante de' Gabrielli di Gubbio, after troops under Charles of Valois entered the city, at the request of Pope Boniface VIII, who supported the Black Guelphs. This exile, which lasted the rest of Dante's life, shows its influence in many parts of the Comedy, from prophecies of Dante's exile to Dante's views of politics, to the eternal damnation of some of his opponents. The last word in each of the three cantiche is stelle (\"stars\")."
  },
  {
    "author": "Jane Austen",
    "country": "United Kingdom",
    "imageLink": "images/pride-and-prejudice.jpg",
    "language": "English",
    "link": "https://en.wikipedia.org/wiki/Pride_and_Prejudice\n",
    "pages": 226,
    "title": "Pride and Prejudice",
    "year": 1813,
    "shortD" : "Its a romantic novel of manners written by Jane Austen in 1813. The novel follows the character development of Elizabeth Bennet, the dynamic protagonist of the book who learns about the repercussions of hasty judgments and comes to appreciate the difference between superficial goodness and actual goodness",
    "longD" : "The novel is set in rural England in the early 19th century. Mrs Bennet attempts to persuade Mr Bennet to visit Mr Bingley, a rich bachelor recently arrived in the neighbourhood. After some verbal sparring with her husband, Mrs Bennet believes he will not call on Mr Bingley. Shortly after, he visits Netherfield, Mr Bingley's rented residence, much to Mrs Bennet's delight. The visit is followed by an invitation to a ball at the local assembly rooms that the entire neighbourhood will attend. At the ball, Mr Bingley’s friendly and cheerful manner makes him popular with guests. He appears attracted to Jane Bennet (the Bennets' eldest daughter), with whom he dances twice. Bingley's friend, Mr Darcy, reputed to be twice as wealthy, is haughty and aloof, causing a decided dislike of him. He declines to dance with Elizabeth (the Bennets' second eldest daughter), stating she is not attractive enough to tempt him. Elizabeth finds this amusing and jokes about it with her sisters. Mr Bingley's sister, Caroline, later invites Jane to Netherfield for dinner. On her way there, Jane is caught in a rain shower and develops a bad cold, forcing her to stay at Netherfield to recuperate. When Elizabeth goes to see Jane, Mr Darcy finds himself becoming attracted to Elizabeth, while Miss Bingley grows jealous, as she herself has designs on Mr Darcy."
  },
  {
    "author": "Honoré de Balzac",
    "country": "France",
    "imageLink": "images/le-pere-goriot.jpg",
    "language": "French",
    "link": "https://en.wikipedia.org/wiki/Le_P%C3%A8re_Goriot\n",
    "pages": 443,
    "title": "Le Père Goriot",
    "year": 1835,
    "shortD" : "It follows the intertwined lives of three characters: the elderly doting Goriot, a mysterious criminal-in-hiding named Vautrin and a naive law student named Eugène de Rastignac.",
    "longD" : " The novel opens with an extended description of the Maison Vauquer, a boarding house in Paris' rue Neuve-Sainte-Geneviève covered with vines, owned by the widow Madame Vauquer. The residents include the law student Eugène de Rastignac, a mysterious agitator named Vautrin, and an elderly retired vermicelli-maker named Jean-Joachim Goriot. The old man is ridiculed frequently by the other boarders, who soon learn that he has bankrupted himself to support his two well-married daughters. Rastignac, who moved to Paris from the south of France, becomes attracted to the upper class. He has difficulty fitting in, but is tutored by his cousin, Madame de Beauséant, in the ways of high society. Rastignac endears himself to one of Goriot's daughters, Delphine, after extracting money from his own already-poor family. Vautrin, meanwhile, tries to convince Rastignac to pursue an unmarried woman named Victorine, whose family fortune is blocked only by her brother. He offers to clear the way for Rastignac by having the brother killed in a duel. Rastignac refuses to go along with the plot, balking at the idea of having someone killed to acquire their wealth, but he takes note of Vautrin's machinations. This is a lesson in the harsh realities of high society. Before long, the boarders learn that police are seeking Vautrin, revealed to be a master criminal nicknamed Trompe-la-Mort (\"Cheater of Death\"). Vautrin arranges for a friend to kill Victorine's brother, in the meantime, and is captured by the police. Goriot, supportive of Rastignac's interest in his daughter and furious with her husband's tyrannical control over her, finds himself unable to help. When his other daughter, Anastasie, informs him that she has been selling off her husband's family jewelry to pay her lover's debts, the old man is overcome with grief at his own impotence and suffers a stroke. Delphine does not visit Goriot as he lies on his deathbed, and Anastasie arrives too late, only once he has lost consciousness. Before dying, Goriot rages about their disrespect toward him. His funeral is attended only by Rastignac, a servant named Christophe, and two paid mourners. Goriot's daughters, rather than being present at the funeral, send their empty coaches, each bearing their families' respective coat of arms. After the short ceremony, Rastignac turns to face Paris as the lights of evening begin to appear. He sets out to dine with Delphine de Nucingen and declares to the city: \"À nous deux, maintenant!\" (\"It's between you and me now!\")"
  },
  {
    "author": "Samuel Beckett",
    "country": "Republic of Ireland",
    "imageLink": "images/molloy-malone-dies-the-unnamable.jpg",
    "language": "French, English",
    "link": "https://en.wikipedia.org/wiki/Molloy_(novel)\n",
    "pages": 256,
    "title": "Molloy, Malone Dies, The Unnamable, the trilogy",
    "year": 1952,
    "shortD" : "Molloy is the first of three novels initially written in Paris between 1947 and 1950; this trio, which includes Malone Dies and The Unnamable, is collectively referred to as ‘The Trilogy’ or ‘the Beckett Trilogy.",
    "longD" : "On first appearance the book concerns two different characters, both of whom have interior monologues in the book. As the story moves along the two characters are distinguished by name only as their experiences and thoughts are similar. The novel is set in an indeterminate place, most often identified with the Ireland of Beckett's birth. The majority of the Part One is made up of Molloy's inner musings interspersed with the action of the plot. It is split into two paragraphs: the first is less than two pages long; the second paragraph lasts for over eighty pages. In the first we are given a vague idea of the setting Molloy is writing in. We are told that he now lives in his mother's room, though how he arrived there or whether his mother died before or during his stay is apparently forgotten. There is also a man who arrives every Sunday to pick up what Molloy has written and bring back what he had taken last week returning them \"marked with signs\" though Molloy never cares to read them. He describes that his purpose while writing is to \"speak of the things that are left, say [his] goodbyes, finish dying.\" In the second paragraph he describes a journey he had taken some time earlier, before he came there, to find his mother. He spends much of it on his bicycle, gets arrested for resting on it in a way that is considered lewd, but is unceremoniously released. From town to anonymous town and across anonymous countryside, he encounters a succession of bizarre characters: an elderly man with a stick; a policeman; a charity worker; a woman whose dog he kills running over it with a bike (her name is never completely determined: \"a Mrs Loy... or Lousse, I forget, Christian name something like Sophie\"), and one whom he falls in love with (\"Ruth\" or maybe \"Edith\"); He abandons his bicycle (which he will not call \"bike\"), walks in no certain direction, meeting \"a young old man\"; a charcoal-burner living in the woods, whom he attacks and savagely beats. Part Two is narrated by a private detective by the name of Jacques Moran, who is given the task by his boss, the mysterious Youdi, of tracking down Molloy. He sets out, taking his recalcitrant son, also named Jacques, with him. They wander across the countryside, increasingly bogged down by the weather, decreasing supplies of food and Moran's suddenly failing body. He sends his son to purchase a bicycle and while his son is gone, Moran encounters two strange men, one of whom Moran murders (in manner comparable to Molloy's), and then hides his body in the forest. Eventually, the son disappears, and he struggles home. At this point in the work, Moran begins to pose several odd theological questions, which make him appear to be going mad. Having returned to his home, now in a state of shambles and disuse, Moran switches to discussing his present state. He has begun to use crutches, just as Molloy does at the beginning of the novel. Also a voice, which has appeared intermittently throughout his part of the text, has begun to significantly inform his actions. The novel ends with Moran explaining that the voice told him \"to write the report.\" Then I went back into the house and wrote, It is midnight. The rain is beating on the windows. It was not midnight. It was not raining. Thus, Moran forsakes reality, beginning to descend into the command of this \"voice\" which may in fact mark the true creation of Molloy. Due to the succession of the book from the first part to the second, the reader is led to believe that time is passing in a similar fashion; however, the second part could be read as a prequel to the first."
  },
  {
    "author": "Giovanni Boccaccio",
    "country": "Italy",
    "imageLink": "images/the-decameron.jpg",
    "language": "Italian",
    "link": "https://en.wikipedia.org/wiki/The_Decameron\n",
    "pages": 1024,
    "title": "The Decameron",
    "year": 1351,
    "shortD" : "The book is structured as a frame story containing 100 tales told by a group of seven young women and three young men sheltering in a secluded villa just outside Florence to escape the Black Death, which was afflicting the city",
    "longD" : "In Italy during the time of the Black Death, a group of seven young women and three young men flee from plague-ridden Florence to a deserted villa in the countryside of Fiesole for two weeks. To pass the evenings, each member of the party tells a story each night, except for one day per week for chores, and the holy days during which they do no work at all, resulting in ten nights of storytelling over the course of two weeks. Thus, by the end of the fortnight they have told 100 stories. Each of the ten characters is charged as King or Queen of the company for one of the ten days in turn. This charge extends to choosing the theme of the stories for that day, and all but two days have topics assigned: examples of the power of fortune; examples of the power of human will; love tales that end tragically; love tales that end happily; clever replies that save the speaker; tricks that women play on men; tricks that people play on each other in general; examples of virtue. Only Dioneo, who usually tells the tenth tale each day, has the right to tell a tale on any topic he wishes, due to his wit. Many authors have argued that Dioneo expresses the views of Boccaccio himself. Each day also includes a short introduction and conclusion to continue the frame of the tales by describing other daily activities besides story-telling. These frame tale interludes frequently include transcriptions of Italian folk songs. The interactions among tales in a day, or across days, as Boccaccio spins variations and reversals of previous material, forms a whole and not just a collection of stories. The basic plots of the stories include mocking the lust and greed of the clergy; tensions in Italian society between the new wealthy commercial class and noble families; and the perils and adventures of traveling merchants."
  },
  {
    "author": "Jorge Luis Borges",
    "country": "Argentina",
    "imageLink": "images/ficciones.jpg",
    "language": "Spanish",
    "link": "https://en.wikipedia.org/wiki/Ficciones\n",
    "pages": 224,
    "title": "Ficciones",
    "year": 1965,
    "shortD" : "Its the most popular collection of short stories by Argentine writer and poet Jorge Luis Borges, produced between 1941 and 1956. The English translation of Fictions was published in 1962, the same year as Labyrinths, a separate compilation of Borges's translated works",
    "longD" : "The labyrinth is a recurring motif throughout the stories. It is used as a metaphor to represent a variety of things: the overwhelmingly complex nature of worlds and the systems that exist on them, human enterprises, the physical and mental aspects of humans, and abstract concepts such as time. The stories of Borges can be seen as a type of labyrinth themselves. Borges often gives his first-person narrators the name \"Borges.\" While he imparts many of his own characteristics in them, he does not idealize them, and gives them human failings as well. English phrases appear intermittently in his Spanish stories. Occasionally, the title is in English. Borges often puts his protagonists in red enclosures. This has led to analysis of his stories from a Freudian viewpoint, although Borges himself strongly disliked his work being interpreted in such a way. In fact, he called psychoanalysis (Obra poética, Prólogo) \"la triste mitología de nuestro tiempo\", or \"the sad mythology of our time\". Borges loved books and gives detailed descriptions of the characteristics of the fictional texts in his stories. In The Approach to Al-Mu'tasim, he indirectly suggests that a librarian is even holier than a saint. Other themes throughout his stories include: philosophical issues; deterioration and ruination; games of strategy and chance; conspiracies and secret societies; and ethnic groups, especially those in his own ancestry."
  },
  {
    "author": "Emily Brontë",
    "country": "United Kingdom",
    "imageLink": "images/wuthering-heights.jpg",
    "language": "English",
    "link": "https://en.wikipedia.org/wiki/Wuthering_Heights\n",
    "pages": 342,
    "title": "Wuthering Heights",
    "year": 1847,
    "shortD" : "Its now a classic of English literature, contemporaneous reviews were deeply polarised; it was controversial because of its unusually stark depiction of mental and physical cruelty, and it challenged strict Victorian ideals regarding religious hypocrisy, morality, social classes and gender inequality.",
    
    "longD" : "In 1801, Lockwood, a wealthy young man from the south of England, who is seeking peace and recuperation, rents Thrushcross Grange in Yorkshire. He visits his landlord, Heathcliff, who lives in a remote moorland farmhouse, Wuthering Heights. There, Lockwood finds an odd assemblage: Heathcliff, who seems to be a gentleman, but whose manners are uncouth; the reserved mistress of the house, who is in her mid-teens; Joseph, a cantankerous old servant of Heathcliff's; and a young man who seems to be a member of the family, yet dresses and speaks as if he were a servant. Snowed in, Lockwood is grudgingly allowed to stay the night and is shown to a bedchamber, where he notices books and graffiti left by a former inhabitant named Catherine. He falls asleep and has a nightmare in which he sees the ghostly Catherine trying and begging to enter through the window. He cries out in fear, rousing Heathcliff, who rushes into the room. Lockwood is convinced that what he saw was real. Heathcliff, believing Lockwood to be right, examines the window and opens it, hoping to allow Catherine's spirit to enter. When nothing happens, Heathcliff shows Lockwood to his own bedroom and returns to keep watch at the window. At sunrise, Heathcliff escorts Lockwood back to Thrushcross Grange. After his visit to the Heights, Lockwood becomes ill and is confined to his bed for some length of time. The Grange housekeeper, Ellen (Nelly) Dean, who is looking after him, tells him the story of the family at the Heights during his convalescence."
  }
  ]
